import time
print('-----------------------')
print('Добро пожаловать нищета')
print('-----------------------')

que = ['А, И, О, Х, М \n что идет дальше?', '8,478,624/5,698 - 140,679/ 99', 'Вотчиноу бар доу ___ \n что идет дальше?']
fo_que = [['Щ, а, ь','И, я', 'О, Р, П', 'ЩЩЩЩЩЩЩ'], [69, 66, 666, 67], ['Бар кекеги','Даун нененги','Танегоу итс э мани','сiкс сeveн']]
ri_ans = ['И, я','67', 'Даун нененги']
money = 0
b = len(que)

for i in range(b):
    print(que[i])

    for j in range(4):
        print(f'{j + 1}. {fo_que[i][j]}')

    b = input('Ваш ответ? \n')

    if b == ri_ans[i]:
        print('ЭТО правильный ответ')
        money += 100
        print(f'Ваш баланс {money}')
    else:
        print('Ужасный ответ')
        print(f'у вас на балансе {money}')

    time.sleep(2)